[
    {
        "id": 1,
        "isbn": "9781788831833",
        "title": "Deep Learning with TensorFlow",
        "authors": [
            "Giancarlo Zaccone",
            "Md. Rezaul Karim"
        ],
        "published_Date": "30/03/2018",
        "publisher": "Packt Publishing Ltd",
        "pages": 483,
        "description": "Delve into neural networks, implement deep learning algorithms, and explore layers of data abstraction with the help of TensorFlow. Key Features Learn how to implement advanced techniques in deep learning with Google's brainchild, TensorFlow Explore deep neural networks and layers of data abstraction with the help of this comprehensive guide Gain real-world contextualization through some deep learning problems concerning research and application Book Description Deep learning is a branch of machine learning algorithms based on learning multiple levels of abstraction. Neural networks, which are at the core of deep learning, are being used in predictive analytics, computer vision, natural language processing, time series forecasting, and to perform a myriad of other complex tasks. This book is conceived for developers, data analysts, machine learning practitioners and deep learning enthusiasts who want to build powerful, robust, and accurate predictive models with the power of TensorFlow, combined with other open source Python libraries. Throughout the book, you’ll learn how to develop deep learning applications for machine learning systems using Feedforward Neural Networks, Convolutional Neural Networks, Recurrent Neural Networks, Autoencoders, and Factorization Machines. Discover how to attain deep learning programming on GPU in a distributed way. You'll come away with an in-depth knowledge of machine learning techniques and the skills to apply them to real-world projects. What you will learn Apply deep machine intelligence and GPU computing with TensorFlow Access public datasets and use TensorFlow to load, process, and transform the data Discover how to use the high-level TensorFlow API to build more powerful applications Use deep learning for scalable object detection and mobile computing Train machines quickly to learn from data by exploring reinforcement learning techniques Explore active areas of deep learning research and applications Who this book is for The book is for people interested in machine learning and machine intelligence. A rudimentary level of programming in one language is assumed, as is a basic familiarity with computer science techniques and technologies, including a basic awareness of computer hardware and algorithms. Some competence in mathematics is needed to the level of elementary linear algebra and calculus.",
        "webs": {
            "Google_Books": "https://play.google.com/store/books/details?id=zZlUDwAAQBAJ&rdid=book-zZlUDwAAQBAJ&rdot=1&source=gbs_api",
            "Amazon_Books": "https://www.amazon.sa/s?k=isbn+9781788831833"
        },
        "price": [
            155.23,
            "SAR"
        ],
        "subtitle": "Explore neural networks and build intelligent systems with Python, 2nd Edition",
        "category": [
            "Computers"
        ],
        "added_date": "25/02/2024 03:46",
        "in_stock": 3
    },
    {
        "id": 2,
        "isbn": "9781640951846",
        "title": "Outwitting the Devil: The Secret to Freedom and Success",
        "authors": [
            "Napoleon Hill"
        ],
        "published_Date": "19/03/2020",
        "publisher": "Sound Wisdom",
        "pages": "288",
        "description": "Napoleon Hill’s Outwitting the Devil\nThe Secret to Freedom and Success\nSecrets from the Vault, Written in 1938, Revealed Today\nAn Official Publication of The Napoleon Hill Foundation\n \n“Napoleon Hill was one of America’s great, influential thinkers who conti\nnues to have an enormous impact today.” —Steve Forbes, editor-in-chief of\n Forbes magazine\n \nBestselling author Napoleon Hill reveals the seven principles of good tha\nt allow us to triumph over obstacles . . . and find success.\n \nUsing his legendary ability to get to the root of human potential, Napole\non Hill digs deep to reveal how fear, procrastination, anger, and jealous\ny prevent us from realizing our personal goals. This long-suppressed para\nble, once considered too controversial to publish, was written by Hill in\n 1938 following the publication of his classic bestseller, Think and Grow\n Rich. Annotated and edited for a contemporary audience by Rich Dad, Poor\n Dad and Three Feet from Gold coauthor Sharon Lechter, this book--now ava\nilable in paper--is profound, powerful, resonant, and rich with insight.\n ",
        "webs": {
            "Amazon_Books": "https://www.amazon.sa/s?k=isbn+9781640951846",
            "Google_Books": "https://play.google.com/store/books/details/Napoleon_Hill_Outwitting_the_Devil?id=cM_TDwAAQBAJ"
        },
        "price": [
            ""
        ],
        "subtitle": "",
        "category": [
            "Business & Economics / Motivational",
            "Self-Help / Motivational & Inspirational",
            "Self-Help / Personal Growth / Success"
        ],
        "added_date": "25/02/2024 03:46",
        "in_stock": 3
    },
    {
        "id": 3,
        "isbn": "9781784395889",
        "title": "Python Penetration Testing Essentials",
        "authors": [
            "Mohit"
        ],
        "published_Date": "28/01/2015",
        "publisher": "Packt Publishing Ltd",
        "pages": "178",
        "description": "If you are a Python programmer or a security researcher who has basic knowledge o\nf Python programming and want to learn about penetration testing with the help of\n Python, this book is ideal for you. Even if you are new to the field of ethical \nhacking, this book can help you find the vulnerabilities in your system so that y\nou are ready to tackle any kind of attack or intrusion.",
        "webs": {
            "Amazon_Books": "https://www.amazon.sa/s?k=isbn+9781784395889",
            "Google_Books": "https://play.google.com/store/books/details/Mohit_Python_Penetration_Testing_Essentials?id=bnNuBgAAQBAJ&hl=en&gl=US"
        },
        "price": [
            45.99,
            "SAR"
        ],
        "subtitle": "",
        "category": [
            "Computers / Languages / Python",
            "Computers / Networking / General",
            "Computers / Security / General"
        ],
        "added_date": "25/02/2024 03:46",
        "in_stock": 2
    }
]